app/controllers/proj_details_controller.rb

SELECT * FROM "proj_details"
---
  def index
    @proj_details = ProjDetail.all

SELECT * FROM "proj_details" WHERE ("proj_details"."id" = 1)
---
  def show
    @proj_detail = ProjDetail.find(params[:id])

SELECT * FROM "proj_details" WHERE ("proj_details"."id" = 2)
---
  def edit
    @proj_detail = ProjDetail.find(params[:id])

INSERT INTO "proj_details" ("month", "PercentageProgress", "PlannedValue", "EarnedValue", "ActualCost", "LRESite", "LREPmc", "CPI", "SPI", "MileStoneBilled", "MileStoneUnbilled", "InternalIssues", "ExternalIssues", "QualityIndex", "HSCIndex", "ProcuredAsphant", "BilledAsphant", "ProcuredConcrete", "BilledConcrete", "ProcuredHSteal", "BilledHSteal", "ProcuredRSteal", "BilledRSteal", "MachineAvailability", "MachineUsed", "ManpowerAvailability", "ManpowerUsed", "created_at", "updated_at") VALUES('2010-04-28', 49, 2367000000.0, NULL, 1958900000.0, NULL, 2367000000.0, 2367000000.0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2010-10-28 16:08:22.171979', '2010-10-28 16:08:22.171979') RETURNING "id"
---
  def create
    @proj_detail = ProjDetail.new(params[:proj_detail])

    respond_to do |format|
      if @proj_detail.save

SELECT * FROM "proj_details" WHERE ("proj_details"."id" = 2)
UPDATE "proj_details" SET "LRESite" = 2367000000.0, "LREPmc" = 2367000000.0, "InternalIssues" = 3.0, "ExternalIssues" = 2.0, "updated_at" = '2010-10-29 09:03:02.562118' WHERE "id" = 2
---
  def update
    @proj_detail = ProjDetail.find(params[:id])

    respond_to do |format|
      if @proj_detail.update_attributes(params[:proj_detail])

SELECT * FROM "proj_details" WHERE ("proj_details"."id" = 1)
DELETE FROM "proj_details" WHERE "id" = 1
---
  def destroy
    @proj_detail = ProjDetail.find(params[:id])
    @proj_detail.destroy