app/controllers/project_details_controller.rb

  def index
    @project_details = ProjectDetail.all
---
SELECT * FROM "project_details"