app/controllers/reports_controller.rb

SELECT * FROM "proj_details" ORDER BY month
---
  def index

    @project_details = ProjDetail.find(:all,:order => 'month')

    @contract_budget_confidence = Hash.new
    @contract_reestimate_confidence = Hash.new

    @pv_cummulative = Hash.new
    @lre_site = Hash.new
    @lre_pmc = Hash.new
    @cpi_cummulative = Hash.new
    @spi_cummulative = Hash.new
    @asphault_usage_cummulative = Hash.new
    @concrete_usage_cummulative = Hash.new
    @hsteel_usage_cummulative = Hash.new
    @rsteel_usage_cummulative = Hash.new
    @machine_usage_cummulative = Hash.new
    @manpower_usage_cummulative = Hash.new

    @sum_of_all_pv = 0.00
    @sum_of_all_lrepmc = 0.00

    flash[:issuelastmonth] == ''
    flash[:issuelastbeforemonth] == ''

    # For Calculating all the summary values  here
    @project_details.each do |projdetail|